tutorials/staticCylinderSheddingTest/bodyFittedCylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     p
//     {
//         solver          amgSolver;
//         cycle           W-cycle;
//         policy          AAMG;
//         nPreSweeps      0;
//         nPostSweeps     2;
//         groupSize       4;
//         minCoarseEqns   30;
//         nMaxLevels      100;
//         scale           on;
//         smoother        ILU;

//         minIter         0;
//         maxIter         500;
//         tolerance       1e-8;
//         relTol          0.0;
//     };

    p
    {
        solver             CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      2;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           off;
            smoother        ILU;
        }

        minIter           0;
        maxIter           100;
        tolerance         1e-6;
        relTol            0.0;
    };

    pFinal
    {
        solver              CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      2;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           off;
            smoother        ILU;
        }

        minIter           0;
        maxIter           100;
        tolerance         1e-6;
        relTol            0.0;
    };

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance        1e-06;
        relTol           0;
        minIter          0;
        maxIter          200;
    };
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// Potential flow solution
SIMPLE
{
    nNonOrthogonalCorrectors 4;
}

// ************************************************************************* //
